app/controllers/items_controller.rb

  def index
    @items = Item.paginate(:include => [:partida, :unidad_medida],:page => @page)
---
SELECT * FROM "items"

  def edit
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 1)

  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("partida_id", "entero", "updated_at", "nombre", "unidad_medida", "codigo", "created_at") VALUES(1, 'f', '2009-06-16 21:22:50', 'HOJAS TAMAÑO CARTA', 'HOJAS', 'MHE-00001', '2009-06-16 21:22:50')

  def update
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 2)