app/controllers/partidas_controller.rb

SELECT * FROM "partidas"
---
  def index
    @partidas = Partida.all

SELECT * FROM "partidas" WHERE ("partidas"."id" = 1)
---
  def show
    @partida = Partida.find(params[:id])

SELECT * FROM "partidas" WHERE ("partidas"."id" = 2)
---
  def edit
    @partida = Partida.find(params[:id])

INSERT INTO "partidas" ("updated_at", "nombre", "codigo", "created_at") VALUES('2009-06-16 21:05:52', 'Primera', '123', '2009-06-16 21:05:52')
---
  def create
    @partida = Partida.new(params[:partida])

    respond_to do |format|
      if @partida.save

SELECT * FROM "partidas" WHERE ("partidas"."id" = 2)
UPDATE "partidas" SET "codigo" = '321', "nombre" = 'Prueba', "updated_at" = '2009-06-16 21:10:21' WHERE "id" = 2
---
  def update
    @partida = Partida.find(params[:id])

    respond_to do |format|
      if @partida.update_attributes(params[:partida])