app/controllers/usuarios_controller.rb

  def index
    #@usuarios = Usuario.all
    #page = params[:page] || 1
    @usuarios = Usuario.paginate(:page => @page)
---
SELECT * FROM "usuarios"

  def show
    @usuario = Usuario.find(params[:id])
---
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1)

  def edit
    @usuario = Usuario.find(params[:id])
---
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1)

  def create
    @usuario = Usuario.new(params[:usuario])

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("updated_at", "nombre", "unidad_id", "ci", "paterno", "cargo", "materno", "activo", "created_at") VALUES('2009-06-16 22:32:51', 'Boris', 1, '3376951', 'Barroso', NULL, 'Camberos', NULL, '2009-06-16 22:32:51')

  def update
    @usuario = Usuario.find(params[:id])

    respond_to do |format|
      if @usuario.update_attributes(params[:usuario])
---
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 1)
UPDATE "usuarios" SET "updated_at" = '2009-06-21 15:59:37', "unidad_id" = 2 WHERE "id" = 1

  def destroy
    @usuario = Usuario.find(params[:id])
    @usuario.destroy
---
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 2)
DELETE FROM "usuarios" WHERE "id" = 2